Repository: sixiaolong1117/WinWoL
Catalog: WinWoL/Language/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr

# AboutAuthor.Text
source: Author
ja_jp: 作者
ko_kr: 저자

# AboutHeader.Text
source: About
ja_jp: 情報
ko_kr: 정보

# AboutMITLicense.Content
source: MIT License
ja_jp: MIT ライセンス
ko_kr: MIT 라이선스

# AboutNSRightTip.Text
source: © 2024 SI Xiaolong. Under MIT License.
ja_jp: © 2024 司晓龙. MIT ライセンスに基づく。
ko_kr: © 2024 시샤오롱. MIT 라이선스에 따라.

# AboutReference.Text
source: Dependencies
ja_jp: 依存関係
ko_kr: 종속성

# AboutRepo.Content
source: Repository
ja_jp: リポジトリ
ko_kr: 저장소

# AboutSponsor.Text
source: Sponsor
ja_jp: スポンサー
ko_kr: 스폰서

# AboutWoL.Text
source: About
ja_jp: 概要
ko_kr: 개요

# AboutWoLRight.Text
source: Remote Toolbox
ja_jp: リモートツールボックス
ko_kr: 원격 도구함

source: Add
ja_jp: 追加
ko_kr: 추가

# AddConfig.Content
source: Add
ja_jp: 追加
ko_kr: 추가

# AddConfig.Label
source: Add
ja_jp: 追加
ko_kr: 추가

# AddConfigDialogTitle.Text
source: Add configuration
ja_jp: 設定を追加
ko_kr: 설정 추가

# AppearanceSetting.Text
source: Appearance
ja_jp: 外観
ko_kr: 모양

# LogSetting.Text
source: Log
ko_kr: 로그

# AppTitle
source: Remote Toolbox
ja_jp: リモートツールボックス
ko_kr: 원격 도구함

source: Cancel
ja_jp: キャンセル
ko_kr: 취소

# Change
source: Update
ja_jp: 更新
ko_kr: 업데이트

source: Confirm
ja_jp: 確認
ko_kr: 확인

# DeleteSSHKeyConfirmPrimaryButton.Content
source: Delete
ko_kr: 삭제

# DeleteSSHKeyConfirmCancelButton.Content
source: Cancel
ko_kr: 취소

# DatabaseSetting.Text
source: Database
ja_jp: データベース
ko_kr: 데이터베이스

# SSHKeySetting.Text
source: SSH Keys
ja_jp: SSH キー
ko_kr: SSH 키

# ManageSSHKeysSetting.Text
source: Manage Built-in SSH Keys
ja_jp: 内蔵 SSH キーの管理
ko_kr: 내장 SSH 키 관리

# ManageSSHKeysButton.Content
source: Manage
ja_jp: 管理
ko_kr: 관리

# ManageSSHKeysDialogTitle.Text
source: SSH Key Management
ja_jp: SSH キー管理
ko_kr: SSH 키 관리

# EmptySSHKeyTips.Text
source: No SSH keys imported yet.
ja_jp: SSH キーがまだインポートされていません。
ko_kr: 아직 SSH 키를 가져오지 않았습니다.

# DialogConfigNameTextBox.Header
source: Name
ja_jp: 名前
ko_kr: 이름

# DialogConfigNameTextBox.PlaceholderText
source: Display name
ja_jp: 表示名
ko_kr: 표시 이름

# DialogGeneral.Text
source: General
ja_jp: 一般
ko_kr: 일반

# DialogIpAddressTextBox.Header
source: Host
ja_jp: ホスト
ko_kr: 호스트

# DialogIpAddressTextBox.PlaceholderText
source: Domain or IP
ja_jp: ドメインまたは IP
ko_kr: 도메인 또는 IP

# DialogRDPHeader.Text
source: RDP Configuration
ja_jp: RDP 設定
ko_kr: RDP 설정

# DialogSSHCommandTextBox.Header
source: SSH Command
ja_jp: SSH コマンド
ko_kr: SSH 명령어

# DialogSSHPortTextBox.Header
source: SSH Port
ja_jp: SSH ポート
ko_kr: SSH 포트

# DialogSSHShutdownHeader.Text
source: SSH Shutdown
ja_jp: SSH シャットダウン
ko_kr: SSH 종료

# DialogSSHUserTextBox.Header
source: SSH User
ja_jp: SSH ユーザー
ko_kr: SSH 사용자

# DialogUsingSSHKeyTextBox.Text
source: Key Auth
ja_jp: キー認証
ko_kr: 키 인증

# DialogWoLHeader.Text
source: WoL Configuration
ja_jp: WoL 設定
ko_kr: WoL 설정

source: Export
ja_jp: エクスポート
ko_kr: 내보내기

# FeedbackBugs.Content
source: Report Issue
ja_jp: 問題を報告
ko_kr: 문제 보고

source: Move Forward
ja_jp: 上に移動
ko_kr: 위로 이동

# HideConfig.Label
source: Show/Hide
ja_jp: 表示/非表示
ko_kr: 표시/숨기기

# ImportConfig.Content
source: Import
ja_jp: インポート
ko_kr: 가져오기

# ImportConfig.Label
source: Import
ja_jp: インポート
ko_kr: 가져오기

# IndependentAddressCheckBox.Content
source: Independent WoL Address
ja_jp: 独立した WoL アドレス
ko_kr: 독립 WoL 주소

# IndependentAddressCheckBoxTips.Text
source: You can fill in the broadcast address as the independent WoL address.
ja_jp: 独立した WoL アドレスにはブロードキャストアドレスを設定できます。
ko_kr: 독립 WoL 주소에는 브로드캐스트 주소를 설정할 수 있습니다.

# IndependentAddressTextBox.Header
source: WoL Address
ja_jp: WoL アドレス
ko_kr: WoL 주소

# IPAddress.Text
source: IP Address
ja_jp: IP アドレス
ko_kr: IP 주소

# LanguageSetting.Text
source: Language
ja_jp: 言語
ko_kr: 언어

# MacAddressTextBox.Header
source: MAC Address
ja_jp: MAC アドレス
ko_kr: MAC 주소

# Overlay
source: Overwrite
ja_jp: 上書き
ko_kr: 덮어쓰기

# PingRefHeader.Text
source: Ping Test
ja_jp: Ping テスト
ko_kr: Ping 테스트

# PingTips.Text
source: Note: The Magic Packet for Wake-on-LAN is sent via UDP. TCP connectivity does not imply UDP reachability.
ja_jp: 注意：Wake-on-LAN のマジックパケットは UDP で送信されます。TCP 接続が可能でも UDP の到達性は保証されません。
ko_kr: 참고: Wake-on-LAN의 매직 패킷은 UDP를 통해 전송됩니다. TCP 연결이 가능하더라도 UDP 연결 가능성을 보장하지 않습니다.

# PRIVACYLink.Content
source: Privacy Policy
ja_jp: プライバシーポリシー
ko_kr: 개인정보 처리방침

# RDPIPPortTextBox.Header
source: RDP Port
ja_jp: RDP ポート
ko_kr: RDP 포트

# RDPPort.Text
source: RDP Port
ja_jp: RDP ポート
ko_kr: RDP 포트

# ResetDatabase.Content
source: Reset Database
ja_jp: データベースをリセット
ko_kr: 데이터베이스 초기화

# ResetDatabaseSetting.Text
source: Reset Database
ja_jp: データベースをリセット
ko_kr: 데이터베이스 초기화

# ResetDatabaseTips.Subtitle
source: This will permanently delete all your configuration data and cannot be undone!
ja_jp: すべての設定データが完全に削除され、復元できなくなります！
ko_kr: 모든 설정 데이터가 영구적으로 삭제되며 복구할 수 없습니다!

# ResetDatabaseTips.Title
source: Reset Database?
ja_jp: データベースをリセットしますか？
ko_kr: 데이터베이스를 초기화하시겠습니까?

source: Run SSH Script
ja_jp: SSH スクリプトを実行
ko_kr: SSH 스크립트 실행

# SelectSSHKeyPath.Content
source: Browse…
ja_jp: 参照…
ko_kr: 찾아보기…

# ImportSSHKeyButton.Content
source: Import Key
ja_jp: キーをインポート
ko_kr: 키 가져오기

# PasteSSHKeyButton.Content
source: Paste Key
ja_jp: キーを貼り付け
ko_kr: 키 붙여넣기

# PasteSSHKeyConfirmButton.Content
source: Confirm
ja_jp: 確認
ko_kr: 확인

# DeleteSSHKeyButton.Content
source: Delete Key
ja_jp: キーを削除
ko_kr: 키 삭제

# ManageSSHKeysNavButton.Content
source: Manage Keys
ko_kr: 키 관리

# SettingsHeader.Text
source: Settings
ja_jp: 設定
ko_kr: 설정

# SponsorMe.Text
source: Sponsor Me:
ja_jp: スポンサーになる：
ko_kr: 후원하기:

# SSHCommandTextBox.Header
source: SSH Shutdown Command
ja_jp: SSH シャットダウンコマンド
ko_kr: SSH 종료 명령어

# SSHHeader
source: SSH Shortcuts
ja_jp: SSH ショートカット
ko_kr: SSH 바로가기

# SSHKeyPathTextBox.Header
source: SSH Key Path
ja_jp: SSH キーパス
ko_kr: SSH 키 경로

# SSHKeyComboBox.Header
source: SSH Key
ja_jp: SSH キー
ko_kr: SSH 키

# PasteSSHKeyDialogTitle.Text
source: Paste SSH Private Key
ja_jp: SSH 秘密鍵を貼り付け
ko_kr: SSH 개인 키 붙여넣기

# SSHKeyNameTextBox.Header
source: Key Name
ja_jp: キー名
ko_kr: 키 이름

# SSHKeyNameTextBox.PlaceholderText
source: Leave blank to use the key comment
ja_jp: 空白の場合はキーコメントを使用
ko_kr: 비워두면 키 주석 사용

# SSHPrivateKeyTextBox.Header
source: Private Key
ja_jp: 秘密鍵
ko_kr: 개인 키

# PasteSSHKeyError
source: Could not parse SSH private key: {0}
ja_jp: SSH 秘密鍵を解析できませんでした：{0}
ko_kr: SSH 개인 키를 분석할 수 없습니다: {0}

# SSHKeyTips1.Text
source: Private keys are imported into the app's built-in key store, so SSH no longer depends on the original file path.
ja_jp: 秘密鍵はアプリ内蔵のキーストアにインポートされるため、SSH は元のファイルパスに依存しなくなります。
ko_kr: 개인 키는 앱 내장 키 저장소로 가져와지므로 SSH가 더 이상 원래 파일 경로에 의존하지 않습니다.

# SSHKeyTips2.Text
source: Key content is encrypted using the current Windows user's data protection scope.
ja_jp: キー内容は現在の Windows ユーザーのデータ保護スコープで暗号化されます。
ko_kr: 키 내용은 현재 Windows 사용자의 데이터 보호 범위로 암호화됩니다.

# WindowsHelloSetting.Text
source: Windows Hello Protection
ko_kr: Windows Hello 보호

# WindowsHelloSettingSubtitle.Text
source: When enabled, Windows Hello verification is required to manage SSH keys
ko_kr: 활성화하면 SSH 키 관리 시 Windows Hello 인증이 필요합니다

# WindowsHelloEnableMessage.Text
source: Verify your identity to enable Windows Hello protection
ko_kr: Windows Hello 보호를 활성화하려면 본인 확인을 해주세요

# WindowsHelloDisableMessage.Text
source: Verify your identity to disable Windows Hello protection
ko_kr: Windows Hello 보호를 비활성화하려면 본인 확인을 해주세요

# WindowsHelloNotAvailable.Text
source: Windows Hello is not available on this device
ko_kr: 이 장치에서 Windows Hello를 사용할 수 없습니다

# WindowsHelloVerifyMessage.Text
source: Verify your identity to proceed
ko_kr: 계속하려면 본인 확인을 해주세요

# DeleteSSHKeyConfirm.Text
source: Are you sure you want to delete this SSH key? This action cannot be undone.
ko_kr: 이 SSH 키를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.

# SSHPasswordBox.Header
source: SSH Password
ja_jp: SSH パスワード
ko_kr: SSH 비밀번호

# SSHPasswordTips1.Text
source: SSH password will be requested before sending. The application does not store your password in any form.
ja_jp: 送信前に SSH パスワードを要求します。アプリケーションはパスワードを一切記録しません。
ko_kr: 전송 전에 SSH 비밀번호를 요청합니다. 애플리케이션은 비밀번호를 어떠한 형태로도 저장하지 않습니다.

# SSHPasswordTips2.Text
source: Note: SSH password login is not a secure option. We recommend using key-based authentication instead.
ja_jp: 注意：SSH パスワードログインは安全ではありません。キー認証の使用をお勧めします。
ko_kr: 참고: SSH 비밀번호 로그인은 안전한 방법이 아닙니다. 키 인증을 사용하는 것을 권장합니다.

# SSHPort.Text
source: SSH Port
ja_jp: SSH ポート
ko_kr: SSH 포트

# SSHPortTextBox.Header
source: SSH Port
ja_jp: SSH ポート
ko_kr: SSH 포트

# SSHResponse.Title
source: SSH Results:
ja_jp: SSH 結果：
ko_kr: SSH 결과:

# SSHShortcutTips.Text
source: Double-click to execute, right-click for context menu
ja_jp: ダブルクリックで実行、右クリックでメニューを表示
ko_kr: 더블클릭으로 실행, 우클릭으로 메뉴 열기

# SSHShutdownCMD.Text
source: SSH Shutdown Command
ja_jp: SSH シャットダウンコマンド
ko_kr: SSH 종료 명령어

# SSHShutdownPort.Text
source: SSH Port
ja_jp: SSH ポート
ko_kr: SSH 포트

# SSHUserTextBox.Header
source: SSH User
ja_jp: SSH ユーザー
ko_kr: SSH 사용자

# TCPingRDPHeader.Text
source: TCPing RDP Port
ja_jp: TCPing RDP ポート
ko_kr: TCPing RDP 포트

# TCPingSSHHeader.Text
source: TCPing SSH Port
ja_jp: TCPing SSH ポート
ko_kr: TCPing SSH 포트

# TCPingWoLHeader.Text
source: TCPing WoL Port
ja_jp: TCPing WoL ポート
ko_kr: TCPing WoL 포트

# ThemeSetting.Text
source: App Theme
ja_jp: テーマ
ko_kr: 테마

# WoLAddress.Text
source: WoL Address
ja_jp: WoL アドレス
ko_kr: WoL 주소

# WoLHeader
source: Remote Tools
ja_jp: リモートツール
ko_kr: 원격 도구

# WoLPort.Text
source: WoL Port
ja_jp: WoL ポート
ko_kr: WoL 포트

# WoLPortTextBox.Header
source: WoL Port
ja_jp: WoL ポート
ko_kr: WoL 포트

# WoLTips1.Text
source: Double-click to wake, right-click for context menu
ja_jp: ダブルクリックで起動、右クリックでメニューを表示
ko_kr: 더블클릭으로 실행, 우클릭으로 메뉴 열기

# WoLTips2.Text
source: Selected configuration details
ja_jp: 選択した設定の詳細
ko_kr: 선택한 설정 상세 정보

source: Move Backward
ja_jp: 下に移動
ko_kr: 아래로 이동

source: Edit
ja_jp: 編集
ko_kr: 편집

# Copy
source: Duplicate
ja_jp: 複製
ko_kr: 복제

source: Delete
ja_jp: 削除
ko_kr: 삭제

source: Magic Packet Sent Successfully!
ja_jp: マジックパケット送信成功！
ko_kr: 매직 패킷 전송 성공!

source: Magic Packet Sending Failed!
ja_jp: マジックパケット送信失敗！
ko_kr: 매직 패킷 전송 실패!

# MagicPacketSentSuccessfullySubtitle
source: The Magic Packet has been sent successfully over UDP.
ja_jp: マジックパケットが UDP で正常に送信されました。
ko_kr: 매직 패킷이 UDP를 통해 성공적으로 전송되었습니다.

# MagicPacketSendingFailedSubtitle
source: Please check your configuration.
ja_jp: 設定内容をご確認ください。
ko_kr: 설정 내용을 확인해 주세요.

# RDP
source: Remote Desktop
ja_jp: リモートデスクトップ
ko_kr: 원격 데스크톱

source: SSH Shutdown
ja_jp: SSH シャットダウン
ko_kr: SSH 종료
